/****************************************Copyright (c)****************************************************
**                                        
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			main.c
** Last modified  Date:          
** Last Version:	1.0
** Descriptions:		
**						
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2014-8-5
** Version:			    1.0
** Descriptions:		指示灯闪烁实验：上电后，指示灯一直闪烁。
**						
**--------------------------------------------------------------------------------------------------------
** Modified by:			
** Modified date:		
** Version:				
** Descriptions:		
**
** Rechecked by:			
**********************************************************************************************************/
#include "nrf24lu1p.h"
#include <stdio.h> 
#include <stdbool.h>
#include <stdint.h>
#include "hal_delay.h"



/*-------------------管脚定义--------------------------------------------------*/
#define  LED    P04  // 开发板上的指示灯
#define  SW     P05  // 开发板上的按键


/* 本例程中nRF24LU1P管脚配置
P00: sck， 编程接口，也可以配置为其他功能。
P01: mosi，编程接口，也可以配置为其他功能。
P02: miso，编程接口，也可以配置为其他功能。
P03: csn， 编程接口，也可以配置为其他功能。

P04：输出，驱动LED	          
P05：输入，按键检测
*/

/*******************************************************************************************************
 * Description : main loop
 * Parameters  : none
 * Return      : none
 *******************************************************************************************************/
void main(void)
{ 
  P0DIR = 0xEF;	      //配置P0:P04配置为输出


  while(1)
  {
	  
		delay_ms(100);
		LED = ~LED;     //LED状态取反
		
  }
}

 /*********************************END FILE****************************************************************/	