/****************************************Copyright (c)****************************************************
**                                        
**                                 
**
**--------------File Info---------------------------------------------------------------------------------
** File name:			main.c
** Last modified  Date:          
** Last Version:	1.0
** Descriptions:		
**						
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2014-8-5
** Version:			    1.0
** Descriptions:		定时器0实验程序。定时器0每20ms产生一次中断，在中断中每隔500ms将LED状态取反
**						      定时时间 = (12/16M)*(TIMER0_VALUE)S
**--------------------------------------------------------------------------------------------------------
** Modified by:			
** Modified date:		
** Version:				
** Descriptions:		
**
** Rechecked by:			
**********************************************************************************************************/
#include "nrf24lu1p.h"
#include <stdio.h> 
#include <stdbool.h>
#include <stdint.h>


/*******************************************************************************************************
 * INTERNAL MACRO DEFINITIONS
 *******************************************************************************************************/
/*-------------------管脚定义--------------------------------------------------*/
#define  LED    P04  // 开发板上的指示灯
#define  SW     P05  // 开发板上的按键


/* 本例程中nRF24LU1P管脚配置
P00: sck， 编程接口，也可以配置为其他功能。
P01: mosi，编程接口，也可以配置为其他功能。
P02: miso，编程接口，也可以配置为其他功能。
P03: csn， 编程接口，也可以配置为其他功能。

P04：输出，驱动LED	          
P05：输入，按键检测
*/


#define TIMER0_VALUE  26666

uint8_t idata count;

void Timer0Init(void)
{
  TMOD = 0x01;	                     //16位定时器
  TH0  = (65536-TIMER0_VALUE)/256;	 //写入初值
  TL0  = (65536-TIMER0_VALUE)%256;
  ET0  = 1;		 //使能Timer0溢出中断
  EA   = 1;		 //使能全局中断
  TR0  = 1;		 //启动Timer0
}
/*******************************************************************************************************
 * Description : main loop
 * Parameters  : none
 * Return      : none
 *******************************************************************************************************/
void main(void)
{ 
  P0DIR = 0xEF;	      //配置P0:P04配置为输出

  count = 0;
	Timer0Init();
	
	while(1);
}

//Timer0中断服务函数
void Timer0_irq() interrupt INTERRUPT_T0
{
  
  TH0=(65536-TIMER0_VALUE)/256;
  TL0=(65536-TIMER0_VALUE)%256;
  count++;
	
	
  if(count == 25)	//500ms 
  {
    count=0;
    LED = ~LED; //LED状态取反
  }
}
 /*********************************END FILE****************************************************************/	